renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/9_CAN_driver/Examples/CAN_Example1_Polling_Loop_Back_Mode/Autosar/Mcal/Base/header/S32K148_FTM.h
#define FTM_CSC_ELSB_MASK                       (0x8U)
#define FTM_CSC_ELSB_SHIFT                      (3U)
#define FTM_CSC_ELSB_WIDTH                      (1U)
#define FTM_CSC_ELSB(x)                         (((uint32_t)(((uint32_t)(x)) << FTM_CSC_ELSB_SHIFT)) & FTM_CSC_ELSB_MASK)

#define FTM_CSC_MSA_MASK                        (0x10U)
#define FTM_CSC_MSA_SHIFT                       (4U)
#define FTM_CSC_MSA_WIDTH                       (1U)
#define FTM_CSC_MSA(x)                          (((uint32_t)(((uint32_t)(x)) << FTM_CSC_MSA_SHIFT)) & FTM_CSC_MSA_MASK)

#define FTM_CSC_MSB_MASK                        (0x20U)
#define FTM_CSC_MSB_SHIFT                       (5U)
#define FTM_CSC_MSB_WIDTH                       (1U)
#define FTM_CSC_MSB(x)                          (((uint32_t)(((uint32_t)(x)) << FTM_CSC_MSB_SHIFT)) & FTM_CSC_MSB_MASK)

#define FTM_CSC_CHIE_MASK                       (0x40U)
#define FTM_CSC_CHIE_SHIFT                      (6U)
#define FTM_CSC_CHIE_WIDTH                      (1U)
#define FTM_CSC_CHIE(x)                         (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHIE_SHIFT)) & FTM_CSC_CHIE_MASK)

#define FTM_CSC_CHF_MASK                        (0x80U)
#define FTM_CSC_CHF_SHIFT                       (7U)
#define FTM_CSC_CHF_WIDTH                       (1U)
#define FTM_CSC_CHF(x)                          (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHF_SHIFT)) & FTM_CSC_CHF_MASK)

#define FTM_CSC_TRIGMODE_MASK                   (0x100U)
#define FTM_CSC_TRIGMODE_SHIFT                  (8U)
#define FTM_CSC_TRIGMODE_WIDTH                  (1U)
#define FTM_CSC_TRIGMODE(x)                     (((uint32_t)(((uint32_t)(x)) << FTM_CSC_TRIGMODE_SHIFT)) & FTM_CSC_TRIGMODE_MASK)

#define FTM_CSC_CHIS_MASK                       (0x200U)
#define FTM_CSC_CHIS_SHIFT                      (9U)
#define FTM_CSC_CHIS_WIDTH                      (1U)
#define FTM_CSC_CHIS(x)                         (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHIS_SHIFT)) & FTM_CSC_CHIS_MASK)

#define FTM_CSC_CHOV_MASK                       (0x400U)
#define FTM_CSC_CHOV_SHIFT                      (10U)
#define FTM_CSC_CHOV_WIDTH                      (1U)
#define FTM_CSC_CHOV(x)                         (((uint32_t)(((uint32_t)(x)) << FTM_CSC_CHOV_SHIFT)) & FTM_CSC_CHOV_MASK)
/*! @} */

/*! @name CnV - Channel (n) Value */
/*! @{ */

#define FTM_CV_VAL_MASK                         (0xFFFFU)
#define FTM_CV_VAL_SHIFT                        (0U)
#define FTM_CV_VAL_WIDTH                        (16U)
#define FTM_CV_VAL(x)                           (((uint32_t)(((uint32_t)(x)) << FTM_CV_VAL_SHIFT)) & FTM_CV_VAL_MASK)
/*! @} */

/*! @name CNTIN - Counter Initial Value */
/*! @{ */

#define FTM_CNTIN_INIT_MASK                      (0xFFFFU)
#define FTM_CNTIN_INIT_SHIFT                     (0U)
#define FTM_CNTIN_INIT_WIDTH                     (16U)
#define FTM_CNTIN_INIT(x)                        (((uint32_t)(((uint32_t)(x)) << FTM_CNTIN_INIT_SHIFT)) & FTM_CNTIN_INIT_MASK)
/*! @} */

/*! @name STATUS - Capture And Compare Status */
/*! @{ */

#define FTM_STATUS_CH0F_MASK                     (0x1U)
#define FTM_STATUS_CH0F_SHIFT                    (0U)
#define FTM_STATUS_CH0F_WIDTH                    (1U)
#define FTM_STATUS_CH0F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH0F_SHIFT)) & FTM_STATUS_CH0F_MASK)

#define FTM_STATUS_CH1F_MASK                     (0x2U)
#define FTM_STATUS_CH1F_SHIFT                    (1U)
#define FTM_STATUS_CH1F_WIDTH                    (1U)
#define FTM_STATUS_CH1F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH1F_SHIFT)) & FTM_STATUS_CH1F_MASK)

#define FTM_STATUS_CH2F_MASK                     (0x4U)
#define FTM_STATUS_CH2F_SHIFT                    (2U)
#define FTM_STATUS_CH2F_WIDTH                    (1U)
#define FTM_STATUS_CH2F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH2F_SHIFT)) & FTM_STATUS_CH2F_MASK)

#define FTM_STATUS_CH3F_MASK                     (0x8U)
#define FTM_STATUS_CH3F_SHIFT                    (3U)
#define FTM_STATUS_CH3F_WIDTH                    (1U)
#define FTM_STATUS_CH3F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH3F_SHIFT)) & FTM_STATUS_CH3F_MASK)

#define FTM_STATUS_CH4F_MASK                     (0x10U)
#define FTM_STATUS_CH4F_SHIFT                    (4U)
#define FTM_STATUS_CH4F_WIDTH                    (1U)
#define FTM_STATUS_CH4F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH4F_SHIFT)) & FTM_STATUS_CH4F_MASK)

#define FTM_STATUS_CH5F_MASK                     (0x20U)
#define FTM_STATUS_CH5F_SHIFT                    (5U)
#define FTM_STATUS_CH5F_WIDTH                    (1U)
#define FTM_STATUS_CH5F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH5F_SHIFT)) & FTM_STATUS_CH5F_MASK)

#define FTM_STATUS_CH6F_MASK                     (0x40U)
#define FTM_STATUS_CH6F_SHIFT                    (6U)
#define FTM_STATUS_CH6F_WIDTH                    (1U)
#define FTM_STATUS_CH6F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH6F_SHIFT)) & FTM_STATUS_CH6F_MASK)

#define FTM_STATUS_CH7F_MASK                     (0x80U)
#define FTM_STATUS_CH7F_SHIFT                    (7U)
#define FTM_STATUS_CH7F_WIDTH                    (1U)
#define FTM_STATUS_CH7F(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH7F_SHIFT)) & FTM_STATUS_CH7F_MASK)
/*! @} */

/*! @name MODE - Features Mode Selection */
/*! @{ */

#define FTM_MODE_FTMEN_MASK                      (0x1U)
#define FTM_MODE_FTMEN_SHIFT                     (0U)
#define FTM_MODE_FTMEN_WIDTH                     (1U)
#define FTM_MODE_FTMEN(x)                        (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FTMEN_SHIFT)) & FTM_MODE_FTMEN_MASK)

#define FTM_MODE_INIT_MASK                       (0x2U)
#define FTM_MODE_INIT_SHIFT                      (1U)
#define FTM_MODE_INIT_WIDTH                      (1U)
#define FTM_MODE_INIT(x)                         (((uint32_t)(((uint32_t)(x)) << FTM_MODE_INIT_SHIFT)) & FTM_MODE_INIT_MASK)

#define FTM_MODE_WPDIS_MASK                      (0x4U)
#define FTM_MODE_WPDIS_SHIFT                     (2U)
#define FTM_MODE_WPDIS_WIDTH                     (1U)
#define FTM_MODE_WPDIS(x)                        (((uint32_t)(((uint32_t)(x)) << FTM_MODE_WPDIS_SHIFT)) & FTM_MODE_WPDIS_MASK)

#define FTM_MODE_PWMSYNC_MASK                    (0x8U)
#define FTM_MODE_PWMSYNC_SHIFT                   (3U)
#define FTM_MODE_PWMSYNC_WIDTH                   (1U)
#define FTM_MODE_PWMSYNC(x)                      (((uint32_t)(((uint32_t)(x)) << FTM_MODE_PWMSYNC_SHIFT)) & FTM_MODE_PWMSYNC_MASK)

#define FTM_MODE_CAPTEST_MASK                    (0x10U)
#define FTM_MODE_CAPTEST_SHIFT                   (4U)
#define FTM_MODE_CAPTEST_WIDTH                   (1U)
#define FTM_MODE_CAPTEST(x)                      (((uint32_t)(((uint32_t)(x)) << FTM_MODE_CAPTEST_SHIFT)) & FTM_MODE_CAPTEST_MASK)

#define FTM_MODE_FAULTM_MASK                     (0x60U)
#define FTM_MODE_FAULTM_SHIFT                    (5U)
#define FTM_MODE_FAULTM_WIDTH                    (2U)
#define FTM_MODE_FAULTM(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FAULTM_SHIFT)) & FTM_MODE_FAULTM_MASK)

#define FTM_MODE_FAULTIE_MASK                    (0x80U)
#define FTM_MODE_FAULTIE_SHIFT                   (7U)
#define FTM_MODE_FAULTIE_WIDTH                   (1U)
#define FTM_MODE_FAULTIE(x)                      (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FAULTIE_SHIFT)) & FTM_MODE_FAULTIE_MASK)
/*! @} */

/*! @name SYNC - Synchronization */
/*! @{ */

#define FTM_SYNC_CNTMIN_MASK                     (0x1U)
#define FTM_SYNC_CNTMIN_SHIFT                    (0U)
#define FTM_SYNC_CNTMIN_WIDTH                    (1U)
#define FTM_SYNC_CNTMIN(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_CNTMIN_SHIFT)) & FTM_SYNC_CNTMIN_MASK)

#define FTM_SYNC_CNTMAX_MASK                     (0x2U)
#define FTM_SYNC_CNTMAX_SHIFT                    (1U)
#define FTM_SYNC_CNTMAX_WIDTH                    (1U)
#define FTM_SYNC_CNTMAX(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_CNTMAX_SHIFT)) & FTM_SYNC_CNTMAX_MASK)

#define FTM_SYNC_REINIT_MASK                     (0x4U)
#define FTM_SYNC_REINIT_SHIFT                    (2U)
#define FTM_SYNC_REINIT_WIDTH                    (1U)
#define FTM_SYNC_REINIT(x)                       (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_REINIT_SHIFT)) & FTM_SYNC_REINIT_MASK)

#define FTM_SYNC_SYNCHOM_MASK                    (0x8U)
#define FTM_SYNC_SYNCHOM_SHIFT                   (3U)
#define FTM_SYNC_SYNCHOM_WIDTH                   (1U)
#define FTM_SYNC_SYNCHOM(x)                      (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_SYNCHOM_SHIFT)) & FTM_SYNC_SYNCHOM_MASK)

#define FTM_SYNC_TRIG0_MASK                      (0x10U)
#define FTM_SYNC_TRIG0_SHIFT                     (4U)
#define FTM_SYNC_TRIG0_WIDTH                     (1U)
#define FTM_SYNC_TRIG0(x)                        (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG0_SHIFT)) & FTM_SYNC_TRIG0_MASK)

#define FTM_SYNC_TRIG1_MASK                      (0x20U)
#define FTM_SYNC_TRIG1_SHIFT                     (5U)
#define FTM_SYNC_TRIG1_WIDTH                     (1U)
#define FTM_SYNC_TRIG1(x)                        (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG1_SHIFT)) & FTM_SYNC_TRIG1_MASK)

